## Plan Result (Demo - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * module.demo-platform.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.demo-platform.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/demo.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/df0ca146-31ba-ca74-35d9-df3d1d293e55" -> (known after apply)
      ~ name                                   = "df0ca146-31ba-ca74-35d9-df3d1d293e55" -> (known after apply)
      ~ principal_id                           = "893dc142-adad-4200-b1d0-30b257f7d7b4" -> "/groups/893dc142-adad-4200-b1d0-30b257f7d7b4" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1857,"Program":"tfcmt","SHA1":"","Target":"Demo - TerraformPlanApply","Vars":{}} -->